ЛИС2/src/Documents/лис_ОтметкаМестонахожденияЛабораторногоОборудования/лис_ОтметкаМестонахожденияЛабораторногоОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>лис_ОтметкаМестонахожденияЛабораторногоОборудования</name>
  <registerRecords>InformationRegister.лис_МестонахождениеЛабораторногоОборудования</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.лис_ЛабораторноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НовоеМестонахождение</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </attributes>
</mdclass:Document>

ЛИС2/src/InformationRegisters/ЛабораторноеОборудованиеВЭксплуатации/ЛабораторноеОборудованиеВЭксплуатации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛабораторноеОборудованиеВЭксплуатации</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаВводаВЭксплуатацию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДопустимойЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.лис_Лаборатории</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.лис_ЛабораторноеОборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаводскойНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаводскоеОбозначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерПаспортаНаОборудование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзготовления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЛИС2/src/Documents/лис_ОтметкаМестонахожденияЛабораторногоОборудования/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Набор = РегистрыСведений.ЛабораторноеОборудованиеВЭксплуатации.СоздатьНаборЗаписей();
	//Набор.Отбор.Регистратор.Установить(Организация);
	Набор.Отбор.Лаборатория.Установить(Лаборатория);
	Набор.Отбор.Оборудование.Установить(Оборудование);
	Набор.Отбор.РегистрационныйНомер.Установить(РегистрационныйНомер);
	Набор.Отбор.ИнвентарныйНомер.Установить(ИнвентарныйНомер);
	Набор.Отбор.ЗаводскойНомер.Установить(ЗаводскойНомер);
	Набор.Прочитать();
	
	Запись = Набор[0];	

	Запись.Организация = НовоеМестонахождение.Владелец;
	Запись.Лаборатория = НовоеМестонахождение;
	
	Набор.Записать();
	
	//Движения.лис_МестонахождениеЛабораторногоОборудования.Записывать = Истина;
	//Движение = Движения.лис_МестонахождениеЛабораторногоОборудования.Добавить();
	//Движение.Период = Дата;
	//Движение.ЛабораторноеОборудование = ЛабораторноеОборудование.Оборудование;
	//Движение.Лаборатория = Лаборатория;
	//Движение.Местонахождение = Местонахождение;
	
КонецПроцедуры

#КонецОбласти
